{"id": 16, "ground_truth": 4100.0, "question": "A store plans to formulate the purchasing and sales plan for a certain product for the first quarter of next year. It is known that the warehouse capacity of the store can store up to 500 units of the product, and there are 200 units in stock at the end of this year. The store purchases goods once at the beginning of each month. The purchasing and selling prices of the product in each month are shown in Table 1.3.\n\nTable 1.3\n\n| Month | 1 | 2 | 3 |\n| :---: | :---: | :---: | :---: |\n| Purchasing Price (Yuan) | 8 | 6 | 9 |\n| Selling Price (Yuan) | 9 | 8 | 10 |\n\nNow, determine how many units should be purchased and sold each month to maximize the total profit, and express this problem as a linear programming model."}
{"id": 19, "ground_truth": 4000.0, "question": "A furniture store can choose to order chairs from three different manufacturers: A, B, and C. The cost of ordering each chair from manufacturer A is $50, from manufacturer B is $45, and from manufacturer C is $40. The store needs to minimize the total cost of the order.\n\nAdditionally, each order from manufacturer A will include 15 chairs, while each order from manufacturers B and C will include 10 chairs. The number of orders must be an integer. The store needs to order at least 100 chairs.\n\nEach order from manufacturer A will include 15 chairs, while each order from manufacturers B and C will include 10 chairs. The store needs to order at most 500 chairs.\n\nIf the store decides to order chairs from manufacturer A, it must also order at least 10 chairs from manufacturer B.\n\nFurthermore, if the store decides to order chairs from manufacturer B, it must also order chairs from manufacturer C."}
{"id": 1, "question": "A marketing company is planning to allocate resources between two projects: $X$ and $Y$. The total resource allocation for both projects cannot exceed 1000 units due to budget constraints. Project $X$ requires a minimum excess of 200 units over project $Y$ to ensure its success. Each unit of resource allocation costs \\$50 for project $X$ and \\$30 for project $Y$. Both projects can only be allocated whole numbers of resources **(integer, ≥ 0)** due to the indivisible nature of these resources. Moreover, the maximum resource allocation for project X is 700 units **(integer, 0 to 700)** and for project Y is 500 units **(integer, 0 to 500)** due to operational constraints.\n\nGiven these conditions, what is the minimum cost (in dollars) required for resource allocation that satisfies all given constraints? Provide your answer rounded to the nearest dollar. \n\nModeling Type: Integer Programming.", "ground_truth": "10000"}
{"id": 2, "question": "A marketing manager is planning the distribution of the budget between two advertising channels for an upcoming campaign. The total budget for both channels combined is constrained to a maximum of $2000. Additionally, to meet the campaign's reach and frequency objectives, the effort from channel X should be three times greater than twice the effort from channel Y, yielding a difference of at least 500 points. Given that the cost per unit of effectiveness for channel $X$ is $50 and for channel $Y$ is $100, and the marketing manager aims to minimize the total cost while meeting all constraints (note: budgets allocated are integers). What would be the minimum total cost in dollars?", "ground_truth": "8350"}
