{"id": 3, "ground_truth": 10349205.0, "question": "For the manufacturing industry, formulating an appropriate product production plan and human resource management scheme is very important for reducing operating costs, inventory costs, stockout costs, and labor costs. Specifically, for products with large demand fluctuations, companies need to accurately predict demand and formulate corresponding production plans. A certain company produces a type of foldable table, the raw material cost for each product is 90 Yuan, and the labor hours are 5 hours. The unit price of the product is 300 Yuan. The company has 1,000 workers at the beginning of January and holds an inventory of 15,000 units. The regular hourly wage for workers is 30 Yuan, with a normal daily working time of 8 hours. Any extra working time is considered overtime, with an overtime hourly wage of 40 Yuan. The number of working days per month is calculated as 20 days. Suppose the company's available production machines are sufficient, and the capacity is not limited by machine hours. Each worker's overtime hours do not exceed 20 hours per month. Holding inventory will generate corresponding inventory costs. If a stockout occurs due to insufficient capacity, there will be certain stockout costs. Additionally, the company can also make up for the stockout part through outsourcing. The outsourcing cost per product, monthly inventory cost, and monthly stockout cost are 200 Yuan, 15 Yuan, and 35 Yuan, respectively. The company's employees are temporary workers, and the company can flexibly decide the number of people to hire and fire each month. The cost of hiring and firing a single employee is 5,000 Yuan and 8,000 Yuan, respectively. Suppose the company has used the existing forecasting model to predict the demand from January to June, as shown in Table 4.1.\n\nTable 4.1: Demand Forecast\n\n| Month | 1   | 2   | 3   | 4   | 5   | 6   |\n|:-----:|:---:|:---:|:---:|:---:|:---:|:---:|\n| Demand Forecast | 20000 | 40000 | 42000 | 35000 | 19000 | 18500 |\n\nPlease formulate a production plan, worker work schedule, and hire/fire plan for the company to maximize the total net profit over 6 months while ensuring that the company holds at least 10,000 units of products by the end of June."}
{"id": 6, "ground_truth": 24250.0, "question": "The contract reservations for the next year for products I, II, and III of a certain factory in each quarter are shown in Table 1-10.\n\nTable 1-10\n| Product | 1    | 2    | 3    | 4    |\n|---------|------|------|------|------|\n| I       | 1500 | 1000 | 2000 | 1200 |\n| II      | 1500 | 1500 | 1200 | 1500 |\n| III     | 1000 | 2000 | 1500 | 2500 |\n\nAt the beginning of the first quarter, there is no inventory for these three products, and it is required to have 150 units in stock for each product by the end of the fourth quarter. It is known that the factory has 15,000 production hours per quarter, and each unit of products I, II, and III requires 2, 4, and 3 hours respectively. Due to a change in equipment, product I cannot be produced in the second quarter. It is stipulated that if the products cannot be delivered on time, a compensation of 20 yuan per unit per quarter delay is required for products I and II, while for product III, the compensation is 10 yuan. Additionally, for products produced but not delivered in the current quarter, the inventory cost is 5 yuan per unit per quarter. How should the factory schedule production to minimize the total cost of compensation and inventory?"}
{"id": 9, "ground_truth": 623.0, "question": "Haus Toys can manufacture and sell toy trucks, toy airplanes, toy boats, and toy trains. The profit for each truck sold is $5, each airplane $10, each boat $8, and each train $7. How many types of toys should Haus Toys manufacture to maximize profits?\n\nThere are 890 units of wood available. Each truck requires 12 units, each airplane 20 units, each boat 15 units, and each train 10 units.\n\nThere are 500 units of steel available. Each airplane requires 3 units, each boat 5 units, each train 4 units, and each truck 6 units.\n\nIf Haus Toys manufactures trucks, they will not manufacture trains.\n\nHowever, if they manufacture boats, they will also manufacture airplanes.\n\nThe number of toy boats manufactured cannot exceed the number of toy trains manufactured."}
{"id": 12, "ground_truth": 13000.0, "question": "Red Star Plastics Factory produces 6 types of plastic containers. The capacity, demand, and variable costs of each container are shown in Table 5-11.\nTable 5-11\n\n| Container Code | 1    | 2    | 3    | 4    | 5    | 6    |\n|----------------|------|------|------|------|------|------|\n| Capacity $/ \\\\mathrm{cm}^3$ | 1500 | 2500 | 4000 | 6000 | 9000 | 12000 |\n| Demand/piece     | 500  | 550  | 700  | 900  | 400  | 300  |\n| Variable Cost/(Yuan/piece) | 5    | 8    | 10   | 12   | 16   | 18   |\n\nEach type of container is produced using different specialized equipment, with a fixed cost of 1200 Yuan for each. When the quantity of a certain container is insufficient to meet demand, larger capacity containers can be used as substitutes. Question: How should production be organized to minimize the total cost while meeting the demand?"}
{"id": 14, "ground_truth": 1.5333333333333334, "question": "Mary is planning tonight's dinner. In addition to the vegetables she previously considered, she also wants to choose chicken, salmon, or tofu as a source of protein. Each 100 grams of chicken contains 23 grams of protein, each 100 grams of salmon contains 20 grams of protein, and each 100 grams of tofu contains 8 grams of protein. The price of chicken is $3 per 100 grams, salmon is $5 per 100 grams, and tofu is $1.5 per 100 grams. Considering Mary's budget is $20, how should she choose the ingredients to maximize protein intake? Additionally, the total weight of the food should not exceed 800 grams, and she needs to select at least three vegetables and one source of protein."}
{"id": 17, "ground_truth": 1.1911788832813004e-09, "question": "Certain strategic bomber groups are tasked with destroying enemy military targets. It is known that the target has four key parts, and destroying any one of them will suffice. The fuel consumption limit for completing this task is 48,000 liters, with a maximum of 48 heavy bombs and 32 light bombs. When carrying heavy bombs, each liter of fuel allows a distance of 2 km, whereas with light bombs, each liter allows 3 km. Additionally, each aircraft can only carry one bomb per trip, and each bombing run requires fuel not only for the round trip (each liter of fuel allows 4 km when the aircraft is empty) but also 100 liters for both takeoff and landing per trip. Relevant data is shown in Table 1-17.\n\nTable 1-17\n| Key Part | Distance from Airport (km) | Probability of Destruction per Heavy Bomb | Probability of Destruction per Light Bomb |\n|----------|----------------------------|-----------------------------------------|------------------------------------------|\n|          |                            |                                         |                                          |\n| 1        | 450                        | 0.10                                    | 0.08                                     |\n| 2        | 480                        | 0.20                                    | 0.16                                     |\n| 3        | 540                        | 0.15                                    | 0.12                                     |\n| 4        | 600                        | 0.25                                    | 0.20                                     |\n\nTo maximize the probability of destroying the enemy military target, how should the bombing plan be determined? Establish a linear programming model for this problem."}
{"id": 26, "ground_truth": 53.0, "question": "The number of salespeople required at a 24-hour convenience store in different time periods is as follows: 2:00-6:00 - 10 people, 6:00-10:00 - 15 people, 10:00-14:00 - 25 people, 14:00-18:00 - 20 people, 18:00-22:00 - 18 people, 22:00-2:00 - 12 people. Salespeople start their shifts at 2:00, 6:00, 10:00, 14:00, 18:00, and 22:00, working continuously for 8 hours. Determine the minimum number of salespeople needed to meet the requirements."}
{"id": 27, "ground_truth": 1146.4142, "question": "A factory produces three types of products: I, II, and III. Each product needs to go through two processing procedures, A and B. The factory has two pieces of equipment that can complete process A, denoted as A1 and A2; it has three pieces of equipment that complete process B, denoted as B1, B2, and B3. Product I can be processed on any equipment for A and B; Product II can be processed on any A equipment but only on B1 for process B; Product III can only be processed on A2 and B2. Given the unit processing time on various machines, raw material costs, product sale prices, effective machine hours, and the costs of operating the machines at full capacity as shown in Table 1-4, the task is to arrange the optimal production plan to maximize the factory's profit.\n\nTable 1-4\n| Equipment  | Product I | Product II | Product III | Effective Machine Hours | Operating Costs at Full Capacity (Yuan) |\n|------------|-----------|------------|-------------|--------------------------|------------------------------------------|\n| A1         | 5         | 10         |             | 6000                     | 300                                      |\n| A2         | 7         | 9          | 12          | 10000                    | 321                                      |\n| B1         | 6         | 8          |             | 4000                     | 250                                      |\n| B2         | 4         |            | 11          | 7000                     | 783                                      |\n| B3         | 7         |            |             | 4000                     | 200                                      |\n| Raw Material Cost (Yuan/Unit) | 0.25 | 0.35       | 0.50       |                          |                                          |\n| Unit Price (Yuan/Unit)        | 1.25 | 2.00       | 2.80       |                          |                                          |"}
{"id": 31, "ground_truth": 1217.3999999999999, "question": "A factory produces three types of products, I, II, and III. Each product requires two processing stages, A and B. It is assumed that the factory has two types of equipment to complete the A processing stage, denoted as A1 and A2; and two types of equipment to complete the B processing stage, denoted as B1 and B2. Product I can be processed on any type of A equipment, but for the B processing stage, it can only be processed on B1 equipment; Product III can only be processed on A2 and B2 equipment. The processing time per piece, raw material cost, sales price of products, effective machine hours for various equipment, and costs of equipment at full capacity are given in Table 1-18. The requirement is to arrange the optimal production plan so that the factory's profit is maximized.\n\nTable 1-18\n| Equipment   | Product I | Product II | Product III | Effective Machine Hours | Cost of Equipment at Full Capacity (Yuan) |\n|-------------|-----------|------------|-------------|------------------------|-------------------------------------------|\n| A1          | 5         | 10         |             | 10000                 | 321                                       |\n| A2          | 7         | 9          | 12          | 4000                  | 250                                       |\n| B1          | 6         | 8          |             | 7000                  | 783                                       |\n| B2          | 4         |            | 11          | 4000                  | 200                                       |\n| B3          | 7         |            |             |                       |                                           |\n| Raw Material Cost (Yuan/Piece) | 0.25      | 0.35       | 0.50       |                        |                                           |\n| Unit Price (Yuan/Piece)        | 1.25      | 2.00       | 2.80       |                        |                                           |"}
{"id": 34, "ground_truth": 7.0, "question": "The current problem faced by the company is how to use the fewest number of containers to pack the currently needed goods for transportation, while considering the weight of the goods, specific packaging requirements, and inventory limitations. Professional modeling and analysis are needed for a batch of goods’ transportation strategy to ensure maximum utilization of the limited container space.\n\nThe company currently has a batch to be transported, with each container able to hold a maximum of 60 tons of goods and each container used must load at least 18 tons of goods. The goods to be loaded include five types: A, B, C, D, and E, with quantities of 120, 90, 300, 90, and 120 respectively. The weights are 0.5 tons for A, 1 ton for B, 0.4 tons for C, 0.6 tons for D, and 0.65 tons for E. Additionally, to meet specific usage requirements, every time A goods are loaded, at least 1 unit of C must also be loaded, but loading C alone does not require simultaneously loading A; and considering the demand limitation for D goods, each container must load at least 12 units of D.\n\nEstablish an operations research model so that the company can use the fewest number of containers to pack this batch of goods."}
{"id": 36, "ground_truth": 1644.63, "question": "The Vehicle Routing Problem (VRP) was first proposed by Dantzig in 1959 (Dantzig and Ramser 1959). It is a very classic combinatorial optimization problem. The basic VRP can usually be described as: In a certain area, there are a certain number of customers and a distribution center or warehouse. Customers are generally distributed in different locations, and each customer has a certain amount of delivery needs. The distribution center or warehouse needs to dispatch a fleet of vehicles and design an appropriate delivery plan to meet the delivery needs of all customers. The goal of VRP is to optimize efficiency while meeting all customer needs. The efficiency is usually measured in the form of an objective function, which varies with the enterprise's requirements. Common objective functions include minimizing the total distance traveled by vehicles, minimizing the total delivery time, and minimizing the number of vehicles used. In addition to meeting customers' delivery needs, VRP usually needs to consider various constraints, giving rise to various variants. For example, if the vehicle's load must not exceed its maximum capacity, the problem becomes the Capacitated Vehicle Routing Problem (CVRP); if each customer's delivery needs must be met within a specific time window, the problem changes to the Vehicle Routing Problem with Time Windows (VRPTW).\n\nThe Vehicle Routing Problem with Time Windows (VRPTW) is a classic problem developed from VRP. In reality, there are many application scenarios for VRPTW. Each customer point generally has a service time window. For example, some logistics centers need to store packages during less busy times, some large supermarkets need to replenish stocks during non-business hours, and real-time delivery methods such as food delivery require delivery within specific time windows. Time windows are divided into soft time windows and hard time windows. Hard Time Windows (HTW) mean that vehicles must arrive at or before the delivery point within the time window and cannot arrive late. If they arrive early, they must wait until the time window starts to perform the service, such as in supermarket restocking and logistics center warehousing. Soft Time Windows (STW) mean that vehicles do not have to arrive within the original hard time window but should try to arrive within it. If vehicles arrive early, there is a cost for early arrival; if they arrive late, there is a penalty, as seen in scenarios such as food delivery, school bus pick-up and drop-off, and industrial delivery.\n\nThe Vehicle Routing Problem with Hard Time Windows (VRPHTW) can be described as follows: There are a certain number of customer points and a distribution center in an area. Vehicles need to depart from and return to the distribution center, and routes should be continuous, with each customer being served by only one vehicle. Vehicles also have a capacity constraint. Each customer has a specific service time window and will only accept service within this window. Vehicles can arrive at customer points early and wait for the time window to open, or they can arrive within the time window to provide service. Vehicles can only start providing service within the time window, and the service time is known. The distribution center needs to arrange a reasonable delivery plan to complete the delivery tasks while minimizing travel costs. Since VRPHTW does not allow delays, it primarily emphasizes travel costs on the routes, similar to VRP. Please now proceed with operations research modeling for VRPHTW."}
{"id": 47, "ground_truth": 20241.615384615387, "question": "A certain farm has 100 hectares of land and 15,000 yuan in funds for production development. The labor force situation on the farm is 3,500 person-days in autumn and winter, and 4,000 person-days in spring and summer. If the labor force itself is not fully utilized, they can work externally, earning 2.1 yuan/person-day in spring and summer and 1.8 yuan/person-day in autumn and winter.\n\nThe farm cultivates three types of crops: soybeans, corn, and wheat, and also raises dairy cows and chickens. Crop cultivation requires no specialized investment, but raising animals involves an investment of 400 yuan per dairy cow and 3 yuan per chicken. Raising dairy cows requires allocating 1.5 hectares of land per cow to grow feed, and involves 100 person-days in autumn and winter, and 50 person-days in spring and summer per cow. The annual net income is 400 yuan per dairy cow. Raising chickens does not use land, requires 0.6 person-days in autumn and winter, and 0.3 person-days in spring and summer per chicken. Annual net income is 2 yuan per chicken. The current chicken coop can accommodate up to 3,000 chickens, and the cow barn can accommodate up to 32 dairy cows. The labor and income requirements for the three types of crops per year are shown in Table 1-9.\n\nTable 1-9\n| Item           | Soybean | Corn | Wheat |\n|----------------|---------|------|-------|\n| Person-days (Autumn/Winter) | 20      | 35   | 10    |\n| Person-days (Spring/Summer) | 50      | 75   | 40    |\n| Annual Net Income (Yuan/hectare) | 175     | 300   | 120   |\n\nDetermine the farm's operating plan to maximize annual net income."}
{"id": 55, "ground_truth": 4.0, "question": "A master's student in Operations Research at a certain university is required to select two courses in mathematics, two in operations research, and two in computer science from a total of seven courses: Calculus, Operations Research, Data Structures, Management Statistics, Computer Simulation, Computer Programming, and Forecasting. Some courses belong to only one category: Calculus falls under Mathematics, Computer Programming under Computer Science. However, some courses fall under multiple categories: Operations Research can be considered both Operations Research and Mathematics, Data Structures both Computer Science and Mathematics, Management Statistics both Mathematics and Operations Research, Computer Simulation both Computer Science and Operations Research, and Forecasting both Operations Research and Mathematics. Courses that fall under multiple categories can fulfill the requirement of both categories simultaneously. Additionally, some courses have prerequisites: Computer Simulation or Data Structures requires Computer Programming first, Management Statistics requires Calculus first, and Forecasting requires Management Statistics first. The question is: What is the minimum number of courses a master's student must take, and which specific courses, to meet the above requirements?"}
{"id": 60, "ground_truth": 153.0, "question": "A traveling salesman must visit 7 customers at 7 different locations, with the (symmetric) distance matrix as follows:\n\n|  | 1 | 2 | 3 | 4 | 5 | 6 | 7 |\n| :---: | :---: | :---: | :---: | :---: | :---: | :---: | :---: |\n| 1 | - | 86 | 49 | 57 | 31 | 69 | 50 |\n| 2 |  | - | 68 | 79 | 93 | 24 | 5 |\n| 3 |  |  | - | 16 | 7 | 72 | 67 |\n| 4 |  |  |  | - | 90 | 69 | 1 |\n| 5 |  |  |  |  | - | 86 | 59 |\n| 6 |  |  |  |  |  | - | 81 |\n\nFormulate a mathematical program to determine the visiting order starting and ending at location 1 to minimize the travel distance, and solve it using COPTPY."}
{"id": 81, "ground_truth": 28.6, "question": "On Danzig Street, vehicles can park on both sides of the street. Mr. Edmonds, who lives at No. 1, is organizing a party with about 30 participants, and they will arrive in 15 cars. The length of the i-th car is λ_i, in meters, as follows:\n\n| i  | 1  | 2   | 3  | 4   | 5   | 6   | 7   | 8   | 9   | 10  | 11  | 12  | 13  | 14  | 15  |\n|----|----|-----|----|-----|-----|-----|-----|-----|-----|-----|-----|-----|-----|-----|-----|\n| λ_i | 4  | 4.5 | 5  | 4.1 | 2.4 | 5.2 | 3.7 | 3.5 | 3.2 | 4.5 | 2.3 | 3.3 | 3.8 | 4.6 | 3   |\n\nIn order to avoid disturbing the neighbors, Mr. Edmonds wants to arrange parking on both sides of the street so that the total length of the street occupied by his friends' vehicles is minimized. Please provide a mathematical programming formulation and solve this problem using AMPL.\nHow does the program change if the cars on one side of the street cannot occupy more than 30 meters?"}
{"id": 83, "ground_truth": 26.0, "question": "A certain restaurant operates around the clock, and the number of waiters needed in 24 hours is shown in Table 1.1.\n\nTable 1.1\n\n| Time        | Minimum Number of Waiters Needed | Time        | Minimum Number of Waiters Needed |\n|:-----------:|:-------------------------------:|:-----------:|:-------------------------------:|\n| $2 \\sim 6$  | 4                                | $14 \\sim 18$| 7                                |\n| $6 \\sim 10$ | 8                                | $18 \\sim 22$| 12                               |\n| $10 \\sim 14$| 10                               | $22 \\sim 2$ | 4                                |\n\nEach waiter works continuously for 8 hours a day. The goal is to find the minimum number of waiters that meet the above conditions and represent this problem as a linear programming model."}
{"id": 85, "ground_truth": 1866.5, "question": "A company is producing two products (X and Y). The resources required for the production of X and Y are divided into two parts: machine time for automated processing and craftsman time for manual finishing. The table below shows the number of minutes required for each product:\n\n| Item | Machine Time (minutes) | Craftsman Time (minutes) |\n| :---: | :---: | :---: |\n| X | 13 | 20 |\n| Y | 19 | 29 |\n\nThe company has 40 hours of machine time available in the next working week, but only 35 hours of craftsman time. The cost of machine time is £10 per hour, and the cost of craftsman time is £2 per hour. Idle time for machines and craftsmen incurs no cost. For each product produced (all products produced will be sold), the revenue for product X is £20, and the revenue for product Y is £30. The company has a specific contract that requires 10 units of product X to be produced for a customer each week. Formulate a model for this problem."}
{"id": 86, "ground_truth": 77500.0, "question": "Healthy Pet Foods Company produces two types of dog food: Meaties and Yummies. Each pack of Meaties contains 2 pounds of grains and 3 pounds of meat; each pack of Yummies contains 3 pounds of grains and 1.5 pounds of meat. The company believes it can sell any quantity of dog food that it can produce. Meaties sell for $2.80 per pack, and Yummies sell for $2.00 per pack. The company's production is subject to several constraints. First, a maximum of 400,000 pounds of grains can be purchased each month at a price of $0.20 per pound of grains. A maximum of 300,000 pounds of meat can be purchased each month at a price of $0.50 per pound of meat. Additionally, a special machine is required to produce Meaties, with a monthly capacity of 90,000 packs. The variable costs for mixing and packaging dog food are $0.25 per pack (Meaties) and $0.20 per pack (Yummies). Detailed information is provided in Table B-1.\n\n**Table B-1 Healthy Pet Foods Data**\n\n|                    | Meaties      | Yummies    |\n|--------------------|--------------|------------|\n| Price per pack     | $2.80        | $2.00      |\n| Raw materials      |              |            |\n| - Grains           | 2.0 lbs      | 3.0 lbs    |\n| - Meat             | 3.0 lbs      | 1.5 lbs    |\n| Variable cost      | $0.25/pack   | $0.20/pack |\n| Resources          |              |            |\n| Meaties capacity   | 90,000 packs/month |       |\n| Monthly available grains | 400,000 lbs |      |\n| Monthly available meat | 300,000 lbs |        |\n\nAssume you are the manager of the dog food department at Healthy Pet Foods Company. Your salary is based on the department's profit, so you will try to maximize profit. How should you operate the department to maximize both the profit and your salary?"}
{"id": 99, "ground_truth": 0.6075, "question": "An electronic system is composed of 3 types of components. The system operates normally if all three components function properly. By installing one or more spare parts for any of the components, the reliability of the components can be improved. The system's operational reliability is the product of the reliabilities of each component, and the reliability of each component is a function of the number of spare parts installed. The first half of the table below shows the function relationship between the number of spare parts and the reliability of a specific component. The prices and weights of the 3 types of components are shown in rows 8 to 9 of the table. Given that the total budget for all spare parts is limited to 150 yuan, and the weight limit is 20 kg, how should spare parts be installed to maximize the system's operational reliability? \n\n\\begin{table}[h]\n\\centering\n\\begin{tabular}{|c|c|c|c|}\n\\hline\n\\textbf{Component Number} & \\textbf{1} & \\textbf{2} & \\textbf{3} \\\\ \\hline\n\\textbf{Number of Spares} &             &             &             \\\\ \\hline\n0                & 0.5         & 0.6         & 0.7         \\\\ \\hline\n1                & 0.6         & 0.75        & 0.9         \\\\ \\hline\n2                & 0.7         & 0.95        & 1.0         \\\\ \\hline\n3                & 0.8         & 1.0         & 1.0         \\\\ \\hline\n4                & 0.9         & 1.0         & 1.0         \\\\ \\hline\n5                & 1.0         & 1.0         & 1.0         \\\\ \\hline\n\\textbf{Unit Price (yuan)}  & 20           & 30           & 40           \\\\ \\hline\n\\textbf{Unit Weight (kg)}  & 2            & 4            & 6            \\\\ \\hline\n\\end{tabular}\n\\caption{Spare Component Data Table}\n\\end{table}"}
{"id": 100, "ground_truth": 84.0, "question": "In network communication services, bandwidth plays an important role. Below is a bandwidth communication table between several communication nodes, showing the bandwidth between any two nodes. If two nodes cannot be directly connected, the corresponding bandwidth is $0$. It is required to establish a link between node $A$ and node $E$ that must pass through service node $C$ (without loops). The bandwidth of this link is defined as the minimum bandwidth value on the link. Please propose a reasonable link arrangement to maximize the bandwidth of this link and find out the maximum bandwidth.\n\n\\begin{table}[h]\n    \\centering\n    \\begin{tabular}{|c|c|c|c|c|c|}\n        \\hline\n        & A & B & C & D & E \\\\\n        \\hline\n        A & 0 & 90 & 85 & 0 & 65 \\\\\n        \\hline\n        B & 95 & 0 & 70 & 65 & 34 \\\\\n        \\hline\n        C & 60 & 0 & 0 & 88 & 80 \\\\\n        \\hline\n        D & 67 & 30 & 25 & 0 & 84 \\\\\n        \\hline\n        E & 0 & 51 & 0 & 56 & 0 \\\\\n        \\hline\n    \\end{tabular}\n\\end{table}"}
